experiment_data/ycsb/Tapir/run-rper50-hst3-srv3-thr3-this1.log
YCSB Client 0.1
Command line: -P workloads/workload50 -t -db com.yahoo.ycsb.db.TapirClient -s -p tapir.configpath=../store/tools/shard -p tapir.nshards=8 -p tapir.closestreplica=1 -p measurement.type=histogram -p histogram.buckets=25 -threads 3 -p operationcount=300000
Loading workload...
Starting test.
 0 sec: 0 operations; 
 10 sec: 22984 operations; 2292.44 current ops/sec; [READ AverageLatency(us)=406.81] [ABORT AverageLatency(us)=59] [COMMIT AverageLatency(us)=875.85] [START AverageLatency(us)=1.02] [UPDATE AverageLatency(us)=427.08] 
 20 sec: 47991 operations; 2499.95 current ops/sec; [READ AverageLatency(us)=354.38]  [COMMIT AverageLatency(us)=832.58] [START AverageLatency(us)=0.99] [UPDATE AverageLatency(us)=366.24] 
 30 sec: 72924 operations; 2493.05 current ops/sec; [READ AverageLatency(us)=358.21]  [COMMIT AverageLatency(us)=832.74] [START AverageLatency(us)=0.99] [UPDATE AverageLatency(us)=369.52] 
 40 sec: 97667 operations; 2474.3 current ops/sec; [READ AverageLatency(us)=364.62]  [COMMIT AverageLatency(us)=838.16] [START AverageLatency(us)=1] [UPDATE AverageLatency(us)=372.7] 
 50 sec: 122553 operations; 2488.35 current ops/sec; [READ AverageLatency(us)=358]  [COMMIT AverageLatency(us)=836.8] [START AverageLatency(us)=0.99] [UPDATE AverageLatency(us)=367.63] 
 60 sec: 147574 operations; 2502.1 current ops/sec; [READ AverageLatency(us)=357]  [COMMIT AverageLatency(us)=831.76] [START AverageLatency(us)=1] [UPDATE AverageLatency(us)=366.15] 
 70 sec: 172516 operations; 2493.95 current ops/sec; [READ AverageLatency(us)=357.13]  [COMMIT AverageLatency(us)=834.69] [START AverageLatency(us)=0.98] [UPDATE AverageLatency(us)=368.23] 
 80 sec: 197466 operations; 2494.75 current ops/sec; [READ AverageLatency(us)=356.83]  [COMMIT AverageLatency(us)=835.72] [START AverageLatency(us)=0.97] [UPDATE AverageLatency(us)=365.77] 
 90 sec: 222415 operations; 2494.9 current ops/sec; [READ AverageLatency(us)=356.1]  [COMMIT AverageLatency(us)=836.91] [START AverageLatency(us)=0.98] [UPDATE AverageLatency(us)=364.29] 
 100 sec: 247488 operations; 2507.05 current ops/sec; [READ AverageLatency(us)=354.41]  [COMMIT AverageLatency(us)=832.12] [START AverageLatency(us)=0.98] [UPDATE AverageLatency(us)=363.65] 
 110 sec: 272452 operations; 2496.4 current ops/sec; [READ AverageLatency(us)=355.26]  [COMMIT AverageLatency(us)=835.27] [START AverageLatency(us)=0.99] [UPDATE AverageLatency(us)=367.01] 
 120 sec: 297470 operations; 2501.55 current ops/sec; [READ AverageLatency(us)=356.07]  [COMMIT AverageLatency(us)=833.04] [START AverageLatency(us)=0.98] [UPDATE AverageLatency(us)=365.26] 
 121 sec: 300000 operations; 1423.75 current ops/sec; [READ AverageLatency(us)=306.02]  [COMMIT AverageLatency(us)=791] [START AverageLatency(us)=0.99] [UPDATE AverageLatency(us)=310.38] 
Database validation succeeded
[OVERALL], RunTime(ms), 121811.0
[OVERALL], Throughput(ops/sec), 2462.8317639622037
[READ], Operations, 149798
[READ], AverageLatency(us), 360.42075995674173
[READ], MinLatency(us), 192
[READ], MaxLatency(us), 14246
[READ], 95thPercentileLatency(ms), 0
[READ], 99thPercentileLatency(ms), 0
[READ], Return=0, 149797
[READ], Return=1, 1
[READ], 0, 149487
[READ], 1, 259
[READ], 2, 16
[READ], 3, 10
[READ], 4, 10
[READ], 5, 0
[READ], 6, 3
[READ], 7, 5
[READ], 8, 6
[READ], 9, 0
[READ], 10, 1
[READ], 11, 0
[READ], 12, 0
[READ], 13, 0
[READ], 14, 1
[READ], 15, 0
[READ], 16, 0
[READ], 17, 0
[READ], 18, 0
[READ], 19, 0
[READ], 20, 0
[READ], 21, 0
[READ], 22, 0
[READ], 23, 0
[READ], 24, 0
[READ], >25, 0
[ABORT], Operations, 1
[ABORT], AverageLatency(us), 59.0
[ABORT], MinLatency(us), 59
[ABORT], MaxLatency(us), 59
[ABORT], 95thPercentileLatency(ms), 0
[ABORT], 99thPercentileLatency(ms), 0
[ABORT], Return=0, 1
[ABORT], 0, 1
[ABORT], 1, 0
[ABORT], 2, 0
[ABORT], 3, 0
[ABORT], 4, 0
[ABORT], 5, 0
[ABORT], 6, 0
[ABORT], 7, 0
[ABORT], 8, 0
[ABORT], 9, 0
[ABORT], 10, 0
[ABORT], 11, 0
[ABORT], 12, 0
[ABORT], 13, 0
[ABORT], 14, 0
[ABORT], 15, 0
[ABORT], 16, 0
[ABORT], 17, 0
[ABORT], 18, 0
[ABORT], 19, 0
[ABORT], 20, 0
[ABORT], 21, 0
[ABORT], 22, 0
[ABORT], 23, 0
[ABORT], 24, 0
[ABORT], >25, 0
[COMMIT], Operations, 299999
[COMMIT], AverageLatency(us), 837.3210177367258
[COMMIT], MinLatency(us), 666
[COMMIT], MaxLatency(us), 14493
[COMMIT], 95thPercentileLatency(ms), 0
[COMMIT], 99thPercentileLatency(ms), 1
[COMMIT], Return=0, 299999
[COMMIT], 0, 288055
[COMMIT], 1, 10465
[COMMIT], 2, 231
[COMMIT], 3, 110
[COMMIT], 4, 263
[COMMIT], 5, 832
[COMMIT], 6, 10
[COMMIT], 7, 16
[COMMIT], 8, 13
[COMMIT], 9, 2
[COMMIT], 10, 1
[COMMIT], 11, 0
[COMMIT], 12, 0
[COMMIT], 13, 0
[COMMIT], 14, 1
[COMMIT], 15, 0
[COMMIT], 16, 0
[COMMIT], 17, 0
[COMMIT], 18, 0
[COMMIT], 19, 0
[COMMIT], 20, 0
[COMMIT], 21, 0
[COMMIT], 22, 0
[COMMIT], 23, 0
[COMMIT], 24, 0
[COMMIT], >25, 0
[START], Operations, 300000
[START], AverageLatency(us), 0.9885233333333333
[START], MinLatency(us), 0
[START], MaxLatency(us), 152
[START], 95thPercentileLatency(ms), 0
[START], 99thPercentileLatency(ms), 0
[START], Return=0, 300000
[START], 0, 300000
[START], 1, 0
[START], 2, 0
[START], 3, 0
[START], 4, 0
[START], 5, 0
[START], 6, 0
[START], 7, 0
[START], 8, 0
[START], 9, 0
[START], 10, 0
[START], 11, 0
[START], 12, 0
[START], 13, 0
[START], 14, 0
[START], 15, 0
[START], 16, 0
[START], 17, 0
[START], 18, 0
[START], 19, 0
[START], 20, 0
[START], 21, 0
[START], 22, 0
[START], 23, 0
[START], 24, 0
[START], >25, 0
[UPDATE], Operations, 150202
[UPDATE], AverageLatency(us), 371.12324736022157
[UPDATE], MinLatency(us), 195
[UPDATE], MaxLatency(us), 11117
[UPDATE], 95thPercentileLatency(ms), 0
[UPDATE], 99thPercentileLatency(ms), 0
[UPDATE], Return=0, 150202
[UPDATE], 0, 149840
[UPDATE], 1, 292
[UPDATE], 2, 29
[UPDATE], 3, 10
[UPDATE], 4, 12
[UPDATE], 5, 5
[UPDATE], 6, 5
[UPDATE], 7, 5
[UPDATE], 8, 1
[UPDATE], 9, 1
[UPDATE], 10, 1
[UPDATE], 11, 1
[UPDATE], 12, 0
[UPDATE], 13, 0
[UPDATE], 14, 0
[UPDATE], 15, 0
[UPDATE], 16, 0
[UPDATE], 17, 0
[UPDATE], 18, 0
[UPDATE], 19, 0
[UPDATE], 20, 0
[UPDATE], 21, 0
[UPDATE], 22, 0
[UPDATE], 23, 0
[UPDATE], 24, 0
[UPDATE], >25, 0